In [2]:
import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [4]:
# 1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age
df.rename(columns={'First Name':'first name','Age':'age'},inplace=True)
df

  first name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [5]:
# 2. Print the first 3 rows of the DataFrame
df.head(3)

  first name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [6]:
# 3. Find the mean age of the individuals
df['age'].mean()

np.float64(32.5)

In [ ]:
# 4. Select and print only the 'Name' and 'City' columns
df[['first name','City']]

4

In [14]:
# 5. Add a new column 'Salary' with random salary values
import numpy as np
df['Salary'] = np.random.randint(50000,size=(df['first name'].size))
df

  first name  age           City  Salary
0      Alice   25       New York    9097
1        Bob   30  San Francisco    3592
2    Charlie   35    Los Angeles   40284
3      David   40        Chicago   31590

In [16]:
# 6. Display summary statistics of the DataFrame
df.describe()

             age        Salary
count   4.000000      4.000000
mean   32.500000  21140.750000
std     6.454972  17594.140945
min    25.000000   3592.000000
25%    28.750000   7720.750000
50%    32.500000  20343.500000
75%    36.250000  33763.500000
max    40.000000  40284.000000